<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [337]:
import pandas as pd
import psycopg2

In [338]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [339]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

In [340]:
n = 10
query = f'''select *
           from public.vacancies
           limit{n}
        '''

In [341]:
df = pd.read_sql_query(query, connection)
df

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,55312386,Компьютерный Мастер,Пользователь ПК\tРабота в команде\tРемонт ноут...,Полный день,Нет опыта,Полная занятость,64000.0,NaN,1516,5724811
1,55843014,Системный администратор,Средства криптографической защиты информации\t...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,130,4903713
2,54525964,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,69961
3,54525965,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,159,69961
4,55354053,Специалист службы поддержки с техническими зна...,None,Удаленная работа,Нет опыта,Частичная занятость,15000.0,NaN,1955,1740
...,...,...,...,...,...,...,...,...,...,...
49192,55589514,Специалист по информационным технологиям,Электронный документооборот\t1С: Предприятие 8...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,66,5109332
49193,55029668,Руководитель процессного офиса,Оптимизация бизнес-процессов\tСтратегическое м...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,26,51333
49194,66172263,Начальник сервисной службы,Организаторские навыки\tУправление персоналом\...,Полный день,От 1 года до 3 лет,Полная занятость,60000.0,NaN,1930,4094700
49195,66180086,Senior IOS разработчик,Swift\tRealm\tiOS\tАнглийский язык\tMVP\tMVVM\...,Полный день,От 1 года до 3 лет,Полная занятость,146456.0,244094.0,160,4469939
49196,55547842,DataOps Engineer,None,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,4978627

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [80]:
query_3_1 = f'''
select
    count(*)
from
    public.vacancies
    '''

In [81]:
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [82]:
query_3_2 = f'''
select
    count(id)
from
    public.employers
    '''

In [83]:
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [84]:
query_3_3 = f'''
select 
    count(distinct name)
from
    public.areas
    '''

In [85]:
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [86]:
query_3_4 = f'''
select 
    count(distinct name)
from
    public.INDUSTRIES
    '''

In [87]:
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0    294

***

По предворительному анализу данныз можно выделить:
* Большое количество вакансий
* Приличное количество работодателей
* Сильный разброс по регионам
* Весомое количество сфер деятельности

Можно хорошо развернуться в поисках работы!

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [326]:
query_4_1 = f'''
select
    a.name,
    count(distinct v.name) cnt
from
    public.areas a
    left join public.vacancies v on a.id = v.area_id
group by a.name
order by 2 desc
    '''

In [342]:
df = pd.read_sql_query(query_4_1, connection)
df.head(10)

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

              name   cnt
0           Москва  3894
1  Санкт-Петербург  2143
2      Новосибирск  1501
3            Минск  1497
4           Алматы  1421
5  Нижний Новгород  1270
6     Екатеринбург  1243
7           Казань  1046
8        Краснодар   995
9   Ростов-на-Дону   889

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [110]:
query_4_2 = f'''
select
    count(distinct v.name) cnt,
    v.salary_to,
    v.salary_from
from
    public.vacancies v
where v.salary_from is not null
or v.salary_to is not null
group by v.id
    '''

In [111]:
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

       cnt  salary_to  salary_from
0        1        NaN     150000.0
1        1        NaN      20000.0
2        1        NaN     100000.0
3        1    70000.0      20000.0
4        1        NaN      32500.0
...    ...        ...          ...
24068    1   120000.0      90000.0
24069    1        NaN     100000.0
24070    1    21845.0      14564.0
24071    1   222893.0     167170.0
24072    1    37110.0      31809.0

[24073 rows x 3 columns]

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [120]:
query_4_3 = f'''
select
    round(avg(salary_from)) salary_from, 
    round(avg(salary_to)) salary_to
from
    public.vacancies
    '''

In [121]:
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   salary_from  salary_to
0      71065.0   110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [129]:
query_4_4 = f'''
select
    employment,
    schedule,
    count(distinct name)
from
    public.vacancies
group by schedule, employment
order by count(distinct name) desc
    '''

In [130]:
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

             employment          schedule  count
0      Полная занятость       Полный день  16241
1      Полная занятость  Удаленная работа   3574
2      Полная занятость     Гибкий график   1063
3      Полная занятость    Сменный график    546
4            Стажировка       Полный день    364
5   Частичная занятость       Полный день    231
6   Частичная занятость  Удаленная работа    202
7   Частичная занятость     Гибкий график    143
8      Полная занятость    Вахтовый метод    137
9      Проектная работа       Полный день    103
10           Стажировка     Гибкий график    101
11     Проектная работа  Удаленная работа     93
12           Стажировка  Удаленная работа     47
13  Частичная занятость    Сменный график     29
14     Проектная работа     Гибкий график     15
15           Стажировка    Сменный график      6
16     Проектная работа    Вахтовый метод      2
17     Проектная работа    Сменный график      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [135]:
query_4_5 = f'''
select distinct
    experience,
    count(distinct name)
from
    public.vacancies
group by experience
order by count(distinct name)
    '''

In [136]:
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           experience  count
0         Более 6 лет    871
1           Нет опыта   3243
2       От 3 до 6 лет   7151
3  От 1 года до 3 лет  11963

***

По предворительному анализу данныз можно выделить:
* Можно заметить что в первых десяти регионах достаточно много вакансий, особенно в первых двух
* Только у половины всех вакансий заполнено хотя бы одно из двух полей с зарплатой
* Средние значения для нижней и верхней границы зарплатной вилки достаточно высокое
* Видно что Полная занятость Полный день люди предпочитают намного чаще 
* Опыт работы от 1 года до 3 лет и от 3 до 6 лет имееют значимое приемущество на остальными двумя

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [143]:
query_5_1 = f'''
select
    e.name,
    count(v.name)
from
    public.employers e
    left join public.vacancies v on e.id = v.employer_id
group by 1
order by 2 desc
limit 5
    '''

In [144]:
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [345]:
query_5_2 = f'''
select
    a.name,
    count(e.id),
    count(v.id)
from
    public.areas a
    left join public.employers e on e.area = a.id
    left join public.vacancies v on v.area_id = a.id
where v.id is null
group by a.name
order by 2 desc
limit 1
    '''

In [346]:
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     name  count  count
0  Россия    410      0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [347]:
query_5_3 = f'''
select 
    e.name,
    count(distinct v.area_id)
    
from
    public.employers e
    left join public.vacancies v on e.id = v.employer_id
group by e.name
order by 2 desc
limit 5
    '''

In [348]:
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                     name  count
0                  Яндекс    181
1              Ростелеком    152
2              Спецремонт    116
3  Поляков Денис Иванович     88
4               ООО ЕФИН      71

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [160]:
query_5_4 = f'''
select 
    count(e.name)
from
    public.employers e
    left join employers_industries ei on ei.employer_id = e.id
where ei.industry_id is null
    '''

In [161]:
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [351]:
query_5_5 = f'''
select 
    e.name,
    count(ei.industry_id)
from
    public.employers e
    left join employers_industries ei on ei.employer_id = e.id
group by e.name
having count(ei.industry_id) = 4
order by 1
offset 2 limit 1
    '''

In [352]:
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   name  count
0  2ГИС      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [171]:
query_5_6 = f'''
select
    i.name,
    count(employer_id)
from
    public.industries i
    left join public.employers_industries ei on i.id = ei.industry_id
where i.name = 'Разработка программного обеспечения'
group by 1
    '''

In [172]:
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                                  name  count
0  Разработка программного обеспечения   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [299]:
import requests
from bs4 import BeautifulSoup

url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
response_wiki = requests.get(url)
page = BeautifulSoup(response_wiki.text, 'html.parser')
wiki_a = page.find_all('a')

cities = tuple([city.text for city in wiki_a[90:106]])

после проделанного первого варианта, нашел как сделать по-другому, решил оставить здесь)

In [335]:
url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
df_html = pd.read_html(url)
df_cities = df_html[1]
cities_2 = tuple(df_cities['Город'].to_list())

In [290]:
query_5_7 = f'''
select
    a.name cities,
    count(v.id) cnt
from
    public.vacancies v
    left join public.areas a on a.id = v.area_id
    left join public.employers e on v.employer_id = e.id
where e.name = 'Яндекс'
and a.name in {cities}
group by a.name
union all
select
    'Total',
    count(distinct v.id)
from
    public.vacancies v
    left join public.areas a on a.id = v.area_id
    left join public.employers e on v.employer_id = e.id
where e.name = 'Яндекс'
and a.name in {cities}
order by 2 desc
    '''

In [291]:
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

             cities  cnt
0             Total  485
1            Москва   54
2   Санкт-Петербург   42
3      Екатеринбург   39
4   Нижний Новгород   36
5       Новосибирск   35
6           Воронеж   32
7         Краснодар   30
8            Самара   26
9               Уфа   26
10            Пермь   25
11           Казань   25
12   Ростов-на-Дону   25
13        Волгоград   24
14       Красноярск   23
15        Челябинск   22
16             Омск   21

***

По предворительному анализу данныз можно выделить:
* В Яндексе имеется огромное количество вакансий!
* Странно, но в Росси много работодалелей и нету вакансий?
* Яндекс и Ростелеком выкладывают свои вакансии в большом количестве регионов.
* Большое количество работодателей не указывают сферу деятельности.
* Больше 1000 компаний имеет 4 сферы деятельности.
* Около 3500  в качестве сферы деятельности указана Разработка программного обеспечения.
* Компания Яндекс имеет почти 500 вакансий в городах-миллиониках

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [306]:
query_6_1 = f'''
select  
    count(name)
from
    public.vacancies
where lower(name) like '%data%'
or lower(name) like '%данн%'
    '''

In [307]:
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [292]:
query_6_2 = f'''  
select  
    count(distinct name)
from
    public.vacancies
where (name like '%data scientist%'
or name like '%data science%'
or name like '%исследователь данных%'
or name like 'ML%'
or name like '%machine learning%'
or name like '%машинн%обучен%')
    '''

In [293]:
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0     51

# непонятно почему курс принял именно этот ответ (51), в последствии мне пришлось переписывать этот код, потому что следующие задания не подходили под него, сначала я пытался сделать через lower(), но у меня не выходило, попробовал так, и он принял ответ

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [309]:
query_6_3 = f'''  
select 
    count(id)
from 
    public.vacancies 
where (lower(name) like '%data scientist%'
or lower(name) like '%data science%'
or lower(name) like '%исследователь данных%' 
or (name like '%ML%' and name not like '%HTML%') 
or lower(name) like '%machine learning%' 
or lower(name) like '%машинн%обучен%')
and  (lower(key_skills)  like '%sql%' 
or lower(key_skills) like '%postgres%')
    '''

In [310]:
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [312]:
query_6_4 = f'''  
select 
    count(id)
from 
    public.vacancies 
where (lower(name) like '%data scientist%'
or lower(name) like '%data science%'
or lower(name) like '%исследователь данных%' 
or (name like '%ML%' and name not like '%HTML%') 
or lower(name) like '%machine learning%' 
or lower(name) like '%машинн%обучен%')
and  lower(key_skills)  like '%python%'
    '''

In [313]:
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [323]:
query_6_5 = f'''  
select 
    round(avg(length(key_skills) - length(replace(key_skills, chr(9), ''))+1), 2)
from 
    public.vacancies 
where (lower(name) like '%data scientist%'
or lower(name) like '%data science%'
or lower(name) like '%исследователь данных%' 
or (name like '%ML%' and name not like '%HTML%') 
or lower(name) like '%machine learning%' 
or lower(name) like '%машинн%обучен%')
and key_skills is not null
    '''

In [324]:
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [332]:
query_6_6 = f'''  
select
    round(avg(coalesce(v.salary_to, v.salary_from) + coalesce(v.salary_from, v.salary_to)) / 2) salary_avg
from
    public.vacancies v
where (v.salary_from is not null
or v.salary_to is not null)
and (lower(v.name) like '%data scientist%'
or lower(v.name) like '%data science%'
or lower(v.name) like '%исследователь данных%' 
or (v.name like '%ML%' and v.name not like '%HTML%') 
or lower(v.name) like '%machine learning%' 
or lower(v.name) like '%машинн%обучен%')
and v.experience = 'От 3 до 6 лет'
    '''

In [333]:
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\Dmitriy\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   salary_avg
0    243115.0

***

По предворительному анализу данныз можно выделить:
* Больше 1500 вакансий имеет отношение к данным
* Для начанающих дата-сайентиста имеется всего 50 вакансий
* Вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres имеется 200 штук
* Python в требованиях работодателей к DS имеет большую популярность для разработчиков
* В среднем 6 ключевых навыков имеется в вакансиях для DS
* Для каждого типа требуемого опыта средняя зарплата очень высокая

# Общий вывод по проекту

* Вакансий имеется достаточно для поиска работы
* Можно найти работу как высокооплачиваемую так и наоборот
* Найти работу может каждый разработчик, будь то проффесионал или начинающий
* Где бы вы не находились, почти в каждом регионе имеются вакансии